h = 6.62607015 * 10**(-34) # Постоянная Планка
c = 2.99792458 * 10**8 # Скорость света в вакууме
G = 6.6743015 * 10**(-11) # Гравитационная постоянная 
pi = 3.1415926535897932384626433832795 # Число Пи
e = 2,7182818284590452353602874713527 # Число Эйлера
E = 1.602176634 * 10**(-19) # Элементарный заряд
g = 9.80665 # Усредненное значение стандартного ускорения свободного падения на Земле
k = 1.380649 * 10**(-23) # Постоянная Больцмана
Mp = 1.67262192369 * 10**(-27) # Масса протона
Me = 9.1093837015 * 10**(-31) # Масса электрона
Mn = 1.67492749805 * 10**(-27) # Масса нейтрона
Mae = 1.66053906661 * 10**(-27) # Атомная единица массы

