# Первое уравнение

x = 3
c = ( ( pow (  ( pow  ( x , 3 ) ) , 0.5 ) )   /   ( ( pow  ( x , 3 ) ) + 3/x ) )
d = ( 4*( pow  ( x , 7 ) ) - ( pow  ( x , 5 ))   )
a = ( c * d )
b = ( 80  *  ( pow  (   ( 27 * ( ( pow  ( x , 4 ) )) + ( 12 * ( pow  ( x , 3 ) ) ) + ( 5 * ( pow  ( x , 2 ) ) ) + 10 )  , 0.5 ) ))
y = ( a + b )
print ( "ответ на первое уравнение", y )

# Второе уравнение

x = 3
c = ( 3 % 2 )
d = ( (167 * 432) // (1000) ) 
a = c + d 
b = 14.5 + ( 31 % 12 ) - ( (pow ( x , 3.4 )  // 1 ))
y = a / b

print ( "ответ на второе уравнение", y )