# Выведите на экран следующие выражения:

# Hello, World!
# Маша + Петя = Любовь
# х = 3 + 4
# х = результат решения предыдущего примера
print()
print("hello, WORLD!")
print()
print("Маша+ Петя = Любовь")
print()
print("x = 3 + 4")
print()
x = 3 + 4
print("x =",x)