# a = [1, 5, ‘Good’, ‘Bad’]
# b = [9, ‘Blue’, ‘Red’, 11]

# 1 выведите на экран результат сложения первого элемента из списка а с третьим элементом списка b
# 2 выведите на экран результат сложения второго элемента из списка а со вторым элементом списка b
# 3 выведите на экран результат умножения нулевого элемента из списка а с нулевым элементом списка b
# 4 выведите на экран результат возведения в степень первого элемента из списка а третьим элементом списка b
# 5 выведите на экран результат сложения списков а и b

a = [1, 5, "Good", "Bad"]
b = [9, "Blue", "Red", 11]

print ( "ответ на 1 =", a[1] + b[3] )
print ()

print ( "ответ на 2 =", a[2] + b[2] )
print ()

print ( "ответ на 3 =", a[0] * b[0] )
print ()

print ( "ответ на 4 =", a[1] ** b[3])
print ()

print ( "ответ на 5 =", a + b )
print ()
